## generate_sbom
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

**⚠️ &nbsp; Warning:** resources will be destroyed by this change!
```terraform
Plan: 6 to add, 0 to change, 2 to destroy
```

<details>
<summary>Show summary</summary>

| CHANGE |                             NAME                              |
|--------|---------------------------------------------------------------|
| add    | `aws_ecr_lifecycle_policy.generate_sbom_trivy_db`             |
|        | `aws_ecr_lifecycle_policy.generate_sbom_trivy_java_db`        |
|        | `aws_ecrpublic_repository.generate_sbom_trivy_db`             |
|        | `aws_ecrpublic_repository.generate_sbom_trivy_java_db`        |
|        | `aws_ecrpublic_repository_policy.generate_sbom_trivy_db`      |
|        | `aws_ecrpublic_repository_policy.generate_sbom_trivy_java_db` |
| delete | `aws_ecrpublic_repository.generate_sbom_public`               |
|        | `aws_ecrpublic_repository_policy.sbom_public_policy`          |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
  - destroy

Terraform will perform the following actions:

  # aws_ecr_lifecycle_policy.generate_sbom_trivy_db will be created
  + resource "aws_ecr_lifecycle_policy" "generate_sbom_trivy_db" {
      + id          = (known after apply)
      + policy      = jsonencode(
            {
              + rules = [
                  + {
                      + action       = {
                          + type = "expire"
                        }
                      + description  = "Delete untagged images"
                      + rulePriority = 1
                      + selection    = {
                          + countNumber = 1
                          + countType   = "imageCountMoreThan"
                          + tagStatus   = "untagged"
                        }
                    },
                ]
            }
        )
      + registry_id = (known after apply)
      + repository  = "security-tools/generate_sbom/trivy-db"
    }

  # aws_ecr_lifecycle_policy.generate_sbom_trivy_java_db will be created
  + resource "aws_ecr_lifecycle_policy" "generate_sbom_trivy_java_db" {
      + id          = (known after apply)
      + policy      = jsonencode(
            {
              + rules = [
                  + {
                      + action       = {
                          + type = "expire"
                        }
                      + description  = "Delete untagged images"
                      + rulePriority = 1
                      + selection    = {
                          + countNumber = 1
                          + countType   = "imageCountMoreThan"
                          + tagStatus   = "untagged"
                        }
                    },
                ]
            }
        )
      + registry_id = (known after apply)
      + repository  = "security-tools/generate_sbom/trivy-java-db"
    }

  # aws_ecrpublic_repository.generate_sbom_public will be destroyed
  # (because aws_ecrpublic_repository.generate_sbom_public is not in configuration)
  - resource "aws_ecrpublic_repository" "generate_sbom_public" {
      - arn             = "arn:aws:ecr-public::794722365809:repository/security-tools/generate_sbom/trivy-db" -> null
      - force_destroy   = false -> null
      - id              = "security-tools/generate_sbom/trivy-db" -> null
      - registry_id     = "794722365809" -> null
      - repository_name = "security-tools/generate_sbom/trivy-db" -> null
      - repository_uri  = "public.ecr.aws/v2v0c4z5/security-tools/generate_sbom/trivy-db" -> null
      - tags            = {
          - "CostCentre" = "security-tools-794722365809"
          - "Product"    = "security-tools-generate_sbom"
          - "Terraform"  = "true"
        } -> null
      - tags_all        = {
          - "CostCentre" = "security-tools-794722365809"
          - "Product"    = "security-tools-generate_sbom"
          - "Terraform"  = "true"
        } -> null

      - catalog_data {}
    }

  # aws_ecrpublic_repository.generate_sbom_trivy_db will be created
  + resource "aws_ecrpublic_repository" "generate_sbom_trivy_db" {
      + arn             = (known after apply)
      + force_destroy   = false
      + id              = (known after apply)
      + registry_id     = (known after apply)
      + repository_name = "security-tools/generate_sbom/trivy-db"
      + repository_uri  = (known after apply)
      + tags            = {
          + "CostCentre" = "security-tools-794722365809"
          + "Product"    = "security-tools-generate_sbom"
          + "Terraform"  = "true"
        }
      + tags_all        = {
          + "CostCentre" = "security-tools-794722365809"
          + "Product"    = "security-tools-generate_sbom"
          + "Terraform"  = "true"
        }
    }

  # aws_ecrpublic_repository.generate_sbom_trivy_java_db will be created
  + resource "aws_ecrpublic_repository" "generate_sbom_trivy_java_db" {
      + arn             = (known after apply)
      + force_destroy   = false
      + id              = (known after apply)
      + registry_id     = (known after apply)
      + repository_name = "security-tools/generate_sbom/trivy-java-db"
      + repository_uri  = (known after apply)
      + tags            = {
          + "CostCentre" = "security-tools-794722365809"
          + "Product"    = "security-tools-generate_sbom"
          + "Terraform"  = "true"
        }
      + tags_all        = {
          + "CostCentre" = "security-tools-794722365809"
          + "Product"    = "security-tools-generate_sbom"
          + "Terraform"  = "true"
        }
    }

  # aws_ecrpublic_repository_policy.generate_sbom_trivy_db will be created
  + resource "aws_ecrpublic_repository_policy" "generate_sbom_trivy_db" {
      + id              = (known after apply)
      + policy          = (sensitive)
      + registry_id     = (known after apply)
      + repository_name = "security-tools/generate_sbom/trivy-db"
    }

  # aws_ecrpublic_repository_policy.generate_sbom_trivy_java_db will be created
  + resource "aws_ecrpublic_repository_policy" "generate_sbom_trivy_java_db" {
      + id              = (known after apply)
      + policy          = (sensitive)
      + registry_id     = (known after apply)
      + repository_name = "security-tools/generate_sbom/trivy-java-db"
    }

  # aws_ecrpublic_repository_policy.sbom_public_policy will be destroyed
  # (because aws_ecrpublic_repository_policy.sbom_public_policy is not in configuration)
  - resource "aws_ecrpublic_repository_policy" "sbom_public_policy" {
      - id              = "security-tools/generate_sbom/trivy-db" -> null
      - policy          = (sensitive) -> null
      - registry_id     = "794722365809" -> null
      - repository_name = "security-tools/generate_sbom/trivy-db" -> null
    }

Plan: 6 to add, 0 to change, 2 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"
Releasing state lock. This may take a few moments...

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh

20 tests, 20 passed, 0 warnings, 0 failures, 0 exceptions

```

</details>
